

"""
Студент з студентським квитком КВ-12121212 влаштовується у різні компанії та набуває певні навички.

Формати даних:

    студентський квиток: дві великі літери англійської абетки у верхньому регістрі, потім -, потім 8 цифр.

    назва компанії: не більше 10 літер англійської абетки у нижньому регістрі, у кінці можуть бути дві цифри, наприклад privat24


"""


#    Сформувати структуру датасету для дного користувача.


dataset = \
{
    "KB-12121212":{
        "personal_data":{
            "name":"Ivan",
            "surname":"Vanko",
            "age":20
        },
        "companies":[{"company1":{"reading", "listening"}},
                     {"privat24":{"pyhon"}},
                     {"epam":{"java","databases"}}],
    }

}
print(dataset)






